lectures/lecture-5-functions-and-macros.md
```mermaid {scale:0.55}
graph TD
    A(["max(num1, num2)"]) --> B{num1 > num2?};
    B -- True --> C[result = num1];
    B -- False --> D[result = num2];
    C --> E;
    D --> E([return result]);
```
